/*
********************************************************************************
*                             ---ofme---
*           Copyleft (c) 2008-2021, 微风山谷/ofourme@163.com
*           License: LGPL
*
*   LOLI3_PACT.H-V1.0.0 (2021.Dec.5th)
*
********************************************************************************
*/

#ifndef __LOLI3_PACT_H__
#define __LOLI3_PACT_H__

/*-DO NOT ADD YOUR CODE BEFORE HERE!-*\\\\\\\\\\\\\\\\\\\\\\\\\\\\\-WIDTH: 80-*/
/******************************************************************************/
/*////////////////////////////////////////////////////////////////////////////*/


//默认跳频频点
#define LOLI3_HOPPING_STARTUP		10,35,60,85,110
#define LOLI3_CHANNEL_STARTUP   33
#define LOLI3_CHANNEL_CONNECT   66

//使用LOVE作为对频暗语
#define LOLI3_ADDRESS_STARTUP	'L','O','V','E','!'

/******************************************************************************/
/*-DO NOT ADD YOUR CODE AFTER HERE!-*\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\-WIDTH: 80-*/

#endif
