/*
********************************************************************************
*                             ---ofme---
*           Copyleft (c) 2008-2023, 微风山谷/ofourme@163.com
*           License: LGPL
*
*   LOLI3_PACT.H-V1.1.0 (2023.Sep.18th)
*
********************************************************************************
*/

#ifndef __LOLI3_PACT_H__
#define __LOLI3_PACT_H__

/*-DO NOT ADD YOUR CODE BEFORE HERE!-*\\\\\\\\\\\\\\\\\\\\\\\\\\\\\-WIDTH: 80-*/
/******************************************************************************/
/*////////////////////////////////////////////////////////////////////////////*/

//使用“LOVE”作为默认地址
#define LOLI3_ADDRESS_STARTUP           'L','O','V','E','!'
#define LOLI3_NRF_DATA_LENGTH           11

//使用33频道作为接收机重连CHANNEL
#define LOLI3_CHANNEL_STARTUP           33
//使用66频道作为接收机启动CHANNEL
#define LOLI3_CHANNEL_CONNECT           66
//跳频CHANNEL数量
#define LOLI3_NUM_HOPPING               5
//默认用于跳频的5个CHANNEL
#define LOLI3_HOPPING_STARTUP           10,35,60,85,110

/*////////////////////////////////////////////////////////////////////////////*/
// update(20230918):
// 舵机输入脉宽0.5~2.5ms，周期20ms；航模舵机一般使用脉宽1~2ms。
// loli3接收机对接收到的通道数据作*27/20=1.35运算，即脉宽=0.811+CH*27/20
// 为保持兼容，同时提升效率，修改为*43(*43可保证10位CH值不溢出16位)同时右移5位=*43/32=1.34375~=1.35，
//     --> 同时修改最低脉宽为0.813以保持中位值1.5ms不变，即脉宽=0.813+CH*43>>5
#define LOLI3_RECV_SERVO_RANGE_MUL      43
#define LOLI3_RECV_SERVO_RANGE_R_SHIFT  5
// 分析loli3接收机源码，当pwm数值小于一定值，直接输出0。此参数按最高1023设置。
#define LOLI3_RECV_PWM_MINNUM_DEFAULT   100

/******************************************************************************/
/*-DO NOT ADD YOUR CODE AFTER HERE!-*\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\-WIDTH: 80-*/

#endif
